kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
        function setting_send(type, elem=null) {
          if (elem) {
            websock.send(type + "=" + elem.value);
          } else {
            websock.send(type + "?");
          }
        }

        function command_stm32(type) {
          websock.send("stm32_cmd=" + type);
        }

    </script>
</head>

<body onload="javascript:start();">
  <center>
    <h2>TX Log Messages</h2>
    <textarea id="logField" rows="40" cols="100" style="margin: 0px; height: 621px; width: 968px;"></textarea>
    <br>
    <button type="button" onclick="saveTextAsFile()" value="save" id="save">Save log to file...</button> |
    <input type="checkbox" id="autoscroll" checked><label for="autoscroll"> Auto scroll</label>
    <hr/>
    <h2>Settings</h2>
    <table>
      <tr>
        <td style="padding: 1px 1px 1px 20px;">
          RF mode:
          <select name="rf_module" onchange="setting_send('S_rf_module', this)" id="rf_module">
            <option value="0"> 900 (SX127x)</option>
            <option value="3">2400 (SX128x)</option>
          </select>
        </td>
        <td style="padding: 1px 20px 1px 1px;" colspan="3" id="region_domain">
          Regulatory domain UNKNOWN
        </td>
      </tr>
      <tr>
        <td style="padding: 1px 20px 1px 1px;">
          Rate:
          <select name="rate" onchange="setting_send('S_rate', this)" id="rates_input">
            <option value="0">200Hz</option>
            <option value="1">100Hz</option>
            <option value="2">50Hz</option>
          </select>
        </td>

        <td style="padding: 1px 20px 1px 20px;">
          Power:
          <select name="power" onchange="setting_send('S_power', this)" id="power_input">
            <option value="R">Reset</option>
            <option value="0">Dynamic</option>
            <option value="1">10mW</option>
            <option value="2">25mW</option>
            <option value="3">50mW</option>
            <option value="4">100mW</option>
            <option value="5">250mW</option>
            <option value="6">500mW</option>
            <option value="7">1000mW</option>
            <option value="8">2000mW</option>
          </select>
        </td>

        <td style="padding: 1px 1px 1px 20px;">
          Telemetry:
          <select name="telemetry" onchange="setting_send('S_telemetry', this)" id="tlm_input">
            <option value="R">Reset</option>
            <option value="0">Off</option>
            <option value="1">1/128</option>
            <option value="2">1/64</option>
            <option value="3">1/32</option>
            <option value="4">1/16</option>
            <option value="5">1/8</option>
            <option value="6">1/4</option>
            <option value="7">1/2</option>
          </select>
        </td>
      </tr>
      <tr>
        <td style="padding: 1px 1px 1px 20px;">
        VTX Settings
        </td>
        <td style="padding: 1px 1px 1px 20px;">
          Freq:
          <select name="vtx_freq" onchange="setting_send('S_vtx_freq', this)" id="vtx_f_input">
            <option value="5740">F1</option>
            <option value="5760">F2</option>
            <option value="5780">F3</option>
            <option value="5800">F4</option>
            <option value="5820">F5</option>
            <option value="5840">F6</option>
            <option value="5860">F7</option>
            <option value="5880">F8</option>
          </select>
        </td>
        <!--
        <td style="padding: 1px 1px 1px 20px;">
          Power:
          <select name="vtx_pwr" onchange="setting_send('S_vtx_pwr', this)" id="vtx_p_input">
            <option value="0">Pit</option>
            <option value="1">0</option>
            <option value="2">1</option>
            <option value="3">2</option>
          </select>
        </td>
        -->
      </tr>
      <tr>
        <!--
        <td style="padding: 1px 1px 1px 20px;">
          RF PWR:
          <select name="rf_pwr" onchange="setting_send('S_rf_pwr', this)" id="rf_pwr">
            <option value="0">0</option>
            <option value="1">1</option>
            <option value="2">2</option>
            <option value="3">3</option>
            <option value="4">4</option>
            <option value="5">5</option>
            <option value="6">6</option>
            <option value="7">7</option>
            <option value="8">8</option>
            <option value="9">9</option>
            <option value="A">10</option>
            <option value="B">11</option>
            <option value="C">12</option>
            <option value="D">13</option>
            <option value="E">14</option>
            <option value="F">15</option>
          </select>
        </td>
        -->
      </tr>
    </table>

    <hr/>
	  <h2>Danger Zone</h2>
    <p>
    <div>
      <form method='POST' action='/update' enctype='multipart/form-data'>
          Self Firmware:
          <input type='file' accept='.bin,.bin.gz' name='backpack_fw' id='esp_fw'>
          <input type='submit' value='Flash Self' id='esp_submit' disabled='disabled'>
      </form>
    </div>
    <br>
    <div>
      <form method='POST' action='/upload' enctype='multipart/form-data'>
          STM32 Firmware:
          <input type='file' accept='.bin,.elrs' name='firmware' id='stm_fw'>
          <input type='text' value='0x0' name='flash_address' size='6' id='stm_addr' class="hide">
          <input type='submit' value='Flash STM32' id='stm_submit' disabled='disabled'>
      </form>
    </div>
    </p>
    <p><span id="validationMessage" class="hide">
      Please check firmware file is correct!
    </span></p>

<script type="text/javascript">
  const message = document.getElementById('validationMessage');
  document.getElementById('esp_fw').onchange = function (ev) {
    const FIRMWARE_PATTERN = /backpack\.bin$/g;
    const uploadButton = document.getElementById('esp_submit');
    const value = ev.target.value;
    if (FIRMWARE_PATTERN.test(value)) {
      uploadButton.removeAttribute('disabled');
      message.classList.add('hide');
    } else {
      uploadButton.setAttribute('disabled', 'disabled');
      message.classList.remove('hide');
    }
  };
  document.getElementById('stm_fw').onchange = function (ev) {
    const FW_PATTERN_BIN = /firmware\.bin$/g;
    const FW_PATTERN_ELRS = /firmware\.elrs$/g;
    const uploadButton = document.getElementById('stm_submit');
    const address = document.getElementById('stm_addr');
    const value = ev.target.value;
    address.classList.add('hide');
    if (FW_PATTERN_BIN.test(value)) {
      uploadButton.removeAttribute('disabled');
      address.classList.remove('hide');
      message.classList.add('hide');
    } else if (FW_PATTERN_ELRS.test(value)) {
      uploadButton.removeAttribute('disabled');
      message.classList.add('hide');
    } else {
      uploadButton.setAttribute('disabled', 'disabled');
      message.classList.remove('hide');
    }
  };
</script>
    <br>
    <div>
    <button onclick="command_stm32('reset')">STM32 Reset</button>
    </div>

